# Taps
tap 'homebrew/cask'
#tap 'homebrew/cask-fonts'
#tap 'homebrew/cask-versions'
tap 'homebrew/bundle'


# Binaries
brew 'mas' # Mac App Store manager
#brew 'bash' # Latest Bash version
#brew 'fish' # fish shell
brew 'zsh-autosuggestions' # fish like autosuggestions for zsh
brew 'zsh-syntax-highlighting' # fish like highlighting for zsh
brew 'coreutils' # Those that come with macOS are outdated
brew 'stow'
brew 'tmux'
brew 'tldr' # explain "man" with examples
brew 'git'


# Apps
cask 'iterm2'
cask 'anaconda'
cask 'visual-studio-code'
cask 'dash' # Great tool for quick access to documentation on various tools, languages and etc.
cask 'airfoil' # A great product from Rogue Amoeba to redirect output to various Airplay devices. I use this to stream Spotify to my HomePod.
cask 'audio-hijack' # Dump audio from any application to be recorded, etc.
cask 'soundsource'  #Let you control audio on a per-app basis, adjusting the volume and output device for individual apps, etc.
cask 'beyond-compare' # For diffing files.
cask 'cakebrew'  # A GUI in front of Homebrew.
cask 'macdown' # Markdown editor.
cask 'rectangle' # https://rectangleapp.com/
cask 'moom'  # Window management tool. Cancustom configurations for the placement of windows on the screen, and let you move windows there with a keystroke.


# Apple Store
#mas 'Tweetbot', id: 1384080005
