# Taps
tap 'homebrew/cask'
#tap 'homebrew/cask-fonts'
#tap 'homebrew/cask-versions'
tap 'homebrew/bundle'


# Binaries
brew 'mas' # Mac App Store manager
#brew 'bash' # Latest Bash version
#brew 'fish' # fish shell
brew 'zsh-autosuggestions' # fish like autosuggestions for zsh
brew 'zsh-syntax-highlighting' # fish like highlighting for zsh
brew 'coreutils' # Those that come with macOS are outdated
brew 'stow'
brew 'tmux'
brew 'wget'
brew 'tree'
brew 'tldr' # explain "man" with examples
brew 'bat' #cat alternative
brew 'exa' #ls alternative
#brew 'fd' #find alternative
brew 'git'
brew 'scala'
brew 'apache-spark'


# Apps
cask 'iterm2'
cask 'anaconda'
cask 'visual-studio-code'
cask 'dash' # Great tool for quick access to documentation on various tools, languages and etc.
# cask 'audio-hijack' # Dump audio from any application to be recorded, etc.
# cask 'soundsource'  #Let you control audio on a per-app basis, adjusting the volume and output device for individual apps, etc.
cask 'beyond-compare' # For diffing files.
cask 'cakebrew'  # A GUI in front of Homebrew.
cask 'rectangle' # https://rectangleapp.com/


# Apple Store
#mas 'Tweetbot', id: 1384080005
